SM_для_EDT/src/InformationRegisters/vftСвязьПунктовСледования/vftСвязьПунктовСледования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>vftСвязьПунктовСледования</name>
  <dimensions>
    <name>Участок</name>
    <type>
      <types>CatalogRef.vftВодныеУчастки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктТекущий</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктСмежный</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МодельРДО</name>
    <comment>Задача № 20785</comment>
    <type>
      <types>CatalogRef.впМодельРДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Catalogs/рарусСправочникСсылок/рарусСправочникСсылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рарусСправочникСсылок</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>FSC</name>
      <description>FSC</description>
    </items>
    <items>
      <name>PSC</name>
      <description>PSC</description>
    </items>
    <items>
      <name>ГПК</name>
      <description>ГПК</description>
    </items>
    <items>
      <name>ДиректоруПоЭксплуатации</name>
      <description>Директор по эксплуатации в родительном падеже</description>
    </items>
    <items>
      <name>ИнтервалМеждуРейсами</name>
      <description>Интервал между рейсами, часы</description>
    </items>
    <items>
      <name>МаслоГД</name>
      <description>Масло ГД</description>
    </items>
    <items>
      <name>МаслоДГ</name>
      <description>Масло ДГ</description>
    </items>
    <items>
      <name>МинКоличествоСтрокАзов</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение Азов&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокКЕК</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение КЕК&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокЛоцман</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение участков с лоцманом&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокРостов</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение Ростов&quot;</description>
    </items>
    <items>
      <name>МодельРДО_ННФ</name>
      <description>Модель РДО (Нефтеналивной флот)</description>
    </items>
    <items>
      <name>МодельРДО_СГФ</name>
      <description>Модель РДО (Сухогрузный флот)</description>
    </items>
    <items>
      <name>МодельРДО_СЗП</name>
      <description>Модель РДО (Морской сухогрузный флот)</description>
    </items>
    <items>
      <name>РМРС</name>
      <description>РМРС</description>
    </items>
    <items>
      <name>ТопливоМТ01</name>
      <description>МТ 0.1</description>
    </items>
    <items>
      <name>ТопливоМТ05</name>
      <description>МТ 0.5</description>
    </items>
    <items>
      <name>ТопливоМТ15</name>
      <description>МТ 1.5</description>
    </items>
    <items>
      <name>ТопливоСМТ</name>
      <description>СМТ</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.vftТиповыеОперации</types>
      <types>CatalogRef.Номенклатура</types>
      <types>String</types>
      <types>CatalogRef.vftПунктыСледования</types>
      <types>Number</types>
      <types>CatalogRef.рарусУчасткиСОЛП</types>
      <types>CatalogRef.впМодельРДО</types>
      <types>CatalogRef.рарусКонтролирующиеОрганы</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SM_для_EDT/src/InformationRegisters/vftСвязьПунктовСледования/ManagerModule.bsl
&НаСервере
Функция ПолучитьМассивСмежныхПунктов(Пункт, Значение = "") Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пункт",Пункт);
	// ++ rarus Камаев П.В. 03.04.2020 Задача № 20785
	Если ТипЗнч(Значение) = Тип("ДокументСсылка.vftРейс") Тогда
		МодельРДО = Значение.Судно.Проект.МодельРДО;
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.vftСуда") Тогда
		МодельРДО = Значение.Проект.МодельРДО;
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.vftПроектыСудов") Тогда
		МодельРДО = Значение.МодельРДО;
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.впМодельРДО") Тогда
		МодельРДО = Значение;
	Иначе
		МодельРДО = Справочники.впМодельРДО.ПустаяСсылка();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МодельРДО1", МодельРДО);
	Запрос.УстановитьПараметр("МодельРДО2", МодельРДО);
	
	//Для СГФ смотрим и по пустому Модели РДО
	Если МодельРДО = Справочники.рарусСправочникСсылок.МодельРДО_СГФ.Значение Тогда
		Запрос.УстановитьПараметр("МодельРДО2", Справочники.впМодельРДО.ПустаяСсылка());
	КонецЕсли;	
	
	// -- rarus Камаев П.В. 03.04.2020
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	vftСвязьПунктовСледования.ПунктСмежный КАК ПунктСмежный
	|ИЗ
	|	РегистрСведений.vftСвязьПунктовСледования КАК vftСвязьПунктовСледования
	|ГДЕ
	|	vftСвязьПунктовСледования.ПунктТекущий = &Пункт
	// ++ rarus Камаев П.В. 03.04.2020 Задача № 20785
	|	И (vftСвязьПунктовСледования.МодельРДО = &МодельРДО1
	|	ИЛИ vftСвязьПунктовСледования.МодельРДО = &МодельРДО2)";
	// -- rarus Камаев П.В. 03.04.2020
	МассивСмежныхПунктов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПунктСмежный");
	// rarus_KloA_21.11.2014 < 
	МассивСмежныхПунктов.Добавить(Пункт);
	// rarus_KloA_21.11.2014 > 
	Возврат МассивСмежныхПунктов;
КонецФункции
